[
    {
        "category": "Key Developmental Milestones",
        "milestones": [
            { "age": 0, "milestone": ["Begins bonding with caregivers through touch, voice, and smell.","Primitive reflexes present: startle, rooting, palmer grasp and stepping/ walking reflex.","Cries to express needs (e.g. hunger, discomfort)."] },
            { "age": 1, "milestone": ["Emerging social smile.","Preference for social stimuli. Follows familiar face and maintains eye contact.","Primitive reflexes present (startle, rooting, palmer grasp, stepping reflex)."] },
            { "age": 2, "milestone": ["Baby smiles intentionally in response to people and social interaction — a big step in bonding and emotional development.","Begins making soft cooing sounds like 'ahh' and 'ooh' to communicate and respond to voices.","Feeds more efficiently; longer stretches between feeds."] },
            { "age": 3, "milestone": ["Head control in supported sitting.","Follows face/toy visually side to side and vertically (chest to brow)","Responsive vocalisation (proto-conversations)."] },
            { "age": 4, "milestone": ["Holds head steady without support when sitting upright or during tummy time — showing strong neck and upper body control.","Laughs and babbles in response to interaction — begins using voice more actively for communication and social bonding.","Reaches for and grasps toys — showing improved hand-eye coordination and fine motor development."] },
            { "age": 5, "milestone": ["Rolls over from tummy to back and may start rolling back to tummy — showing growing strength and mobility.","Explores with hands and mouth — grasps toys, brings them to mouth, and begins passing objects between hands.","Responds to name and tone of voice — turns head toward sounds and shows recognition of familiar voices and people."] },
            { "age": 6, "milestone": ["Starts to weight bear when supported to stand and sits with straight back when held - showing strong core and postural control.","Babbles with consonant sounds – begins using repetitive sounds like 'ba-ba,' 'da-da,' or 'ga-ga' as early language practice.","Reaches and grabs objects easily – uses hands more skillfully, transfers toys between hands, and often brings them to mouth for exploration."] },
            { "age": 7, "milestone": ["Sits independently without support and may reach for toys while maintaining balance.","Responds to their name and understands simple words like 'no' or 'bye-bye.'","Transfers objects between hands and begins using a raking motion to pick up smaller items."] },
            { "age": 8, "milestone": ["Crawls or starts moving independently (e.g. scooting or army crawling) — building toward greater mobility.","Says simple sounds with meaning — like 'mama' or 'dada' (even if not always directed correctly).","Develops object permanence — understands that things still exist even when out of sight (e.g. looks for a hidden toy)."] },
            { "age": 9, "milestone": ["Pulls to stand and may begin cruising along furniture — building leg strength and coordination.","Uses pincer grasp (thumb and forefinger) to pick up small items like snacks.","Understands simple words and gestures like 'no,' 'bye-bye,' and may wave or clap.","Developing understanding of cause-and-effect e.g. if I press this button, something will happen."] },
            { "age": 10, "milestone": ["Cruises along furniture — walks while holding on, showing growing balance and leg strength.","Understands simple instructions — may respond to 'give me,' 'come here,' or 'no.'","Imitates actions and sounds — waves, claps, or makes sounds after seeing others do it."] },
            { "age": 11, "milestone": ["Stands alone briefly and may take a few steps without support — early walking often begins around this age.","Says one or two words with meaning (e.g., 'mama,' 'dada,' 'ball').","Shows intentional communication — points to objects, uses gestures, and may bring things to share or show."] },
            { "age": 12, "milestone": ["Takes first independent steps or is already walking — a major gross motor milestone.","Says 1–3 clear words besides 'mama' or 'dada' and understands simple instructions.","Mature pincer grasp - able to use index finger and thumb to grasp small objects.","Initiating joint attention - follows adult's gaze, points to an object and then looks back at the adult (Foundational skill of learning language and cognitive development).","Follows simple instructions associated with gestures (e.g. 'give it to daddy/mummy' with pointing)."] }
        ]
    },
    {
        "category": "Attention and Listening",
        "milestones": [
            { "age": 0, "milestone": ["Turns head toward familiar voices (especially caregiver’s).", "Startles or blinks at loud sounds.", "Shows brief periods of alertness, especially when looking at faces or high-contrast objects."]},
            { "age": 1, "milestone": ["Recognizes and is calmed by familiar voices (especially caregiver's).", "May startle or blink at loud sounds.", "Brief alert periods; prefers looking at faces and high-contrast objects."] },
            { "age": 2, "milestone": ["Turns head toward sounds and voices.","Looks at caregiver’s face more steadily.","Briefly follows objects with eyes and may track from side to side."]},
            { "age": 3, "milestone": ["Turns head toward sounds and voices more consistently.","Listens intently to speech; may quiet or smile in response.","Tracks objects smoothly with both eyes.","Pays attention to faces, especially caregiver’s."]},
            { "age": 4, "milestone": ["Turns head toward voices and sounds consistently.","Pays close attention to faces and surroundings.","Calms or smiles at familiar voices and music."] },
            { "age": 5, "milestone": ["Turns head to locate familiar voices or interesting sounds.","Watches people and objects move across the room.","Shows curiosity and increased attention span during play."] },
            { "age": 6, "milestone": ["Turns toward sounds, including voices and rattles.","Starts to follow adult pointing towards objects or people.","When exploring objects, can seem totally absorbed and may seem oblivious to carer's attempts to engage in interaction.","Pays attention to music or interesting noises.","Looks around actively and tracks movement easily."] },
            { "age": 7, "milestone": ["Turns head toward sounds consistently.","Recognizes own name and responds to it.","Looks at objects or people when named (e.g., looks at 'mama' or 'ball')."] },
            { "age": 8, "milestone": ["Pays close attention to voices and environmental sounds.","Recognizes and responds to own name consistently.","Looks toward familiar words like 'ball,' 'bottle,' or 'mama.'","Notices when someone enters or leaves the room.","Watches activities of people or animals within 3-4 metres with sustained interest for several minutes.","Gaze-switching between objects and people."] },
            { "age": 9, "milestone": ["Turns consistently to their name and familiar voices.","Pays attention to conversations and music.","Looks at familiar objects or people when named.","Enjoys looking at books and pictures with a caregiver."] },
            { "age": 10, "milestone": ["Cruises along furniture — walks while holding on, showing growing balance and leg strength.","Understands simple instructions — may respond to 'give me,' 'come here,' or 'no.'","Imitates actions and sounds — waves, claps, or makes sounds after seeing others do it."] },
            { "age": 11, "milestone": ["Responds to name consistently and turns to look when spoken to.","Follows simple directions (e.g. 'give me the toy').","Pays close attention to speech, songs, and familiar routines.","Recognizes common words for people, objects, and actions."] },
            { "age": 12, "milestone": ["Responds consistently to their name.","Understands and follows simple instructions within context and with gestures (e.g., 'come here,' 'give it to me').","Looks at or points to familiar objects when named.","Pays attention to short stories, songs, or rhymes.","Initiating joint-attention: follows adult's gaze, actively switches attention between objects and adults (foundational skill of learning language and other cognitive development)."] }
        ]
    },
    {
        "category": "Feeding",
        "milestones": [
            { "age": 0, "milestone": ["Uses sucking and swallowing reflexes to feed (breast or bottle).","Feeds every 2-4 hours (day and night).","Shows hunger cues like rooting or sucking on hands.","(Deep) Suck: (Deep) Swallow: Breathe ratio = 1:1:1 or 2:2:1"]},
            { "age": 1, "milestone": ["Feeds every 2–4 hours (breast or bottle).","Sucking and swallowing reflexes are well developed."] },
            { "age": 2, "milestone": ["More efficient sucking (feeds may be shorter but more effective).","May start showing a more predictable feeding routine.","Improved coordination of sucking, swallowing, and breathing."]},
            { "age": 3, "milestone": ["Feeding is more coordinated and may take less time.","May start to have longer stretches between feeds.","Shows hunger and fullness cues more clearly.","May begin drooling more, though not yet teething.","Sucks or licks lips in anticipation to feeding prep sounds."] },
            { "age": 4, "milestone": ["More efficient and coordinated feeding.","May begin showing interest in caregiver’s food (though solids typically start around 6 months).","May feed less often at night as stretches of sleep increase.","Some babies start to teeth at 4 months (look out for increased drooling, swollen or tender gums, fussiness)."] },
            { "age": 5, "milestone": ["Shows strong interest in food others are eating.","May begin practicing sitting with support for upcoming solids introduction (often at 6 months).","Continues to breastfeed/formula feed with improved efficiency."] },
            { "age": 6, "milestone": ["May begin eating semi-solids.","Sits with support in a high chair for meals.","Opens mouth when food is offered.","Initially spits out food using back-and-forth tongue movements.","Continues to breastfeed/formula feed regularly.","Puts hand on breast while feeding; or if bottle-fed, puts hand on bottle and pats it."] },
            { "age": 7, "milestone": ["May be eating purées or soft solids if started at 6 months.","Opens mouth for spoon; may start chewing motions.","Begins practicing sipping from a cup with help.","Uses hands to try and hold bottle or spoon."] },
            { "age": 8, "milestone": ["Eats puréed and some soft finger foods.","Begins developing pincer grasp (thumb and forefinger) — helpful for self-feeding.","Drinks water from a sippy or open cup with help.","May try chewing with gums even without teeth."] },
            { "age": 9, "milestone": ["Eats a wider variety of soft solids and finger foods.","Drinks water from a sippy or open cup with support.","Begins practicing self-feeding using fingers.","May show interest in using a spoon (with assistance).","Holds, bites and chews small pieces of food.","Tries to grasp spoon when being fed.","Enjoys babbling with a mouthful of food."] },
            { "age": 10, "milestone": ["Feeds self small finger foods confidently.","Drinks from a sippy or open cup with help.","May try to hold a spoon or help guide it to mouth.","Eats a variety of soft solids and mashed foods."] },
            { "age": 11, "milestone": ["Feeds self small bites of soft food with fingers.","Drinks from a sippy or open cup with minimal help.","May try to use a spoon or bring it to mouth (messily!).","Eats 3 meals and 1–2 snacks per day in addition to breastmilk/formula."] },
            { "age": 12, "milestone": ["Feeds self finger foods confidently.","Drinks from a sippy or open cup with help.","May use a spoon to self-feed with assistance, though messy.","Eats a variety of textures and begins transitioning from breast/formula to cow’s milk (as advised by doctor).","Munches food at sides of their mouth."] }
        ]
    },
    {
        "category": "Sleeping",
        "milestones": [
            { "age": 0, "milestone": ["Sleeps around 16–18 hours per day in short stretches.","No established day-night pattern yet.","Wakes frequently for feeds."]},
            { "age": 1, "milestone": ["Sleeps about 16–18 hours a day, spread out in short stretches.","No day-night rhythm yet."]},
            { "age": 2, "milestone": ["Sleeps about 14–16 hours a day.","Longer sleep stretches at night (e.g. 3-5 hours), but waking for feeds is still common.","Daytime sleep split into 3–5 naps.","May start to develop a more predictable sleep-wake pattern."]},
            { "age": 3, "milestone": ["Sleeps around 14–16 hours per day (including naps).","May sleep 4–6 hour stretches at night.","3–4 naps during the day are typical.","Begins showing signs of longer nighttime sleep and more wakeful daytime play."] },
            { "age": 4, "milestone": ["Sleeps about 12–16 hours/day, including naps.","May sleep 6–8 hour stretches at night (though waking is still normal).","Typically takes 3–4 naps during the day."] },
            { "age": 5, "milestone": ["Sleeps around 12–15 hours/day including 2–3 naps.","May sleep 6–8 hour stretches at night, though some still wake for feeds.","Starts showing more consistent sleep-wake patterns."] },
            { "age": 6, "milestone": ["Sleeps around 12–15 hours per day, including 2–3 naps.","May sleep 6–8 hour stretches at night.","Daytime and nighttime routines may start becoming more regular."] },
            { "age": 7, "milestone": ["Sleeps about 12–14 hours/day, often with 2–3 naps.","May sleep longer stretches at night (6–10 hours), though some still wake.","Starts developing stronger sleep associations and routines."] },
            { "age": 8, "milestone": ["Sleeps around 12–14 hours per day, including 2 naps (occasionally 3).","May sleep 8–10 hour stretches at night (though night waking is still normal).","More predictable nap and bedtime routines may emerge."] },
            { "age": 9, "milestone": ["Sleeps around 12–14 hours per day, with 2 naps (morning and afternoon).","May sleep 10–12 hours at night (though night waking is still common).","Sleep patterns and routines are usually more established."] },
            { "age": 10, "milestone": ["Sleeps about 12–14 hours in 24 hours, typically with 2 naps.","May sleep 10–12 hours at night, but some still wake occasionally.","Consistent bedtime and nap routines help support sleep quality."] },
            { "age": 11, "milestone": ["Sleeps 12–14 hours in 24 hours, typically with 2 naps.","May sleep through the night (9–12 hours), though some babies still wake.","Routines are more consistent and helpful in maintaining good sleep habits."] },
            { "age": 12, "milestone": ["Sleeps 11–14 hours/day, often with 1–2 naps.","Some babies transition to 1 nap/day around this time.","May sleep through the night but can still experience sleep regressions."] }
        ]
    },
    {
        "category": "Gross Motor Skills",
        "milestones": [
            { "age": 0, "milestone": ["Limited head control; needs neck support.","Lifts head briefly during tummy time.","Shows primitive reflexes (startle, rooting, stepping)."]},
            { "age": 1, "milestone": ["Limited head control.","Reflexive movements (startle, stepping, rooting).","Begins lifting head briefly when on tummy.","Still has primitive reflexes (startle, rooting, stepping)"] },
            { "age": 2, "milestone": ["Holds head up more steadily when upright.","Begins to push up on arms when on tummy.","Moves arms and legs more purposefully and less jerkily."]},
            { "age": 3, "milestone": ["Little to no head lag when pulled to sit.","Head control steadier when supported to sit.","Head and shoulders lifted, starting to push up onto forearms during tummy time.","Kicks legs strongly when lying on back - legs alternating and sometimes together.","May begin rolling from tummy to back (though not yet common)."] },
            { "age": 4, "milestone": ["Holds head steady without support.","Pushes down with legs when feet are on a firm surface.","Rolls from tummy to back (some may begin this earlier or later).","Lifts chest and upper body during tummy time, using forearms."] },
            { "age": 5, "milestone": ["Rolls from tummy to back, and may start rolling both ways.","Pushes up on straight arms during tummy time.","Bears weight on legs when held upright.","May sit with support (e.g., propped on hands or pillows)."] },
            { "age": 6, "milestone": ["Sits with little or no support for short periods.","Rolls over in both directions (tummy to back, back to tummy).","Pushes up with straight arms during tummy time.","Begins to rock or pivot on tummy; may start trying to crawl."] },
            { "age": 7, "milestone": ["Sits independently without needing hands for support.","Rolls both ways confidently.","May start to pivot, scoot, or crawl (though crawling can start anytime between 6–10 months).","Bears weight well on legs when held upright."] },
            { "age": 8, "milestone": ["Crawls, scoots, or rolls to get to objects (some may still be developing crawling).","Sits independently and securely, able to twist or pivot while seated.","Bears weight on legs when supported in standing position.","May begin pulling up to stand (early standers)."] },
            { "age": 9, "milestone": ["Pulls to stand using furniture or caregiver’s hands.","Crawls efficiently or uses another method of mobility (e.g. scooting, rolling).","Begins to cruise (walks holding onto furniture).","Sits confidently without support and may twist or pivot to grab toys."] },
            { "age": 10, "milestone": ["Cruises along furniture (walking while holding on).","Pulls to stand with confidence.","May stand briefly without support.","Crawls quickly and may begin experimenting with climbing or walking with a push toy."] },
            { "age": 11, "milestone": ["Pulls to stand and cruises along furniture confidently.","Stands alone briefly and may take a few steps without help.","Crawls quickly and climbs over low obstacles.","May start using a push toy to walk."] },
            { "age": 12, "milestone": ["Can rise to sitting from lying down with ease.","Stands independently and walks with or without assistance.","Crawls on hands and knees, shuffles on buttocks, 'bearwalks', cruises, or uses push toys if not walking yet.","Squats to pick up a toy and may rise without support.","May begin climbing onto low furniture or stairs with help."] }
        ]
    },
    {
        "category": "Fine Motor Skills",
        "milestones": [
            { "age": 0, "milestone": ["Hands mostly in fists.","Strong grasp reflex (grasps finger placed in palm).","Brings hands to mouth."]},
            { "age": 1, "milestone": ["Hands often clenched in fists.","Strong grasp reflex.","May bring hands to mouth."] },
            { "age": 2, "milestone": ["Hands open more often.","Brings hands to mouth with increasing control.","Begins to reach for and grasp objects (but may not always succeed).","May bat at dangling toys.","Starts tracking hand movement visually."]},
            { "age": 3, "milestone": ["Brings hands together in midline (e.g. clapping motion).","Swipes at toys or reaches out with more control.","Grasps toys briefly when placed in hand.","Explores hands visually and by mouthing."] },
            { "age": 4, "milestone": ["Brings hands to mouth regularly.","Reaches for and grasps toys with both hands.","Begins to shake toys or bring them to mouth.","Coordinates eyes and hands better."] },
            { "age": 5, "milestone": ["Reaches and grasps objects with more accuracy.","Brings hands and toys to mouth.","Starts passing toys from one hand to the other.","Explores textures with hands and fingers."] },
            { "age": 6, "milestone": ["Stretches out both hands simultaneously to grasp.","Uses a raking motion to pick up small items.","Transfers objects from one hand to the other.","Drops one object if another is offered.","Brings toys to mouth for exploration.","Starts banging objects together or on surfaces."] },
            { "age": 7, "milestone": ["Transfers toys between hands with ease.","Reaches and grasps with more accuracy.","Uses a raking grasp to pick up small objects.","Bangs toys together or against surfaces."] },
            { "age": 8, "milestone": ["Transfers objects easily from one hand to the other.","Uses a raking grasp to pick up small items like puffs or cereal.","Bangs toys together or on surfaces to explore cause and effect.","May begin trying to feed self with fingers."] },
            { "age": 9, "milestone": ["Uses pincer grasp (thumb and forefinger) to pick up small items.","Transfers objects from hand to hand with control.","Bangs toys together or against surfaces.","Explores toys by shaking, dropping, and passing them.","Starts to point at more distant objects with index finger.","Enjoys casting objects over the side of cot or chair.","Can release toy from grasp by dropping or pressing against a firm surface but canont yet release smoothly."] },
            { "age": 10, "milestone": ["Pincer grasp is well-developed — picks up small items like cereal with thumb and forefinger.","Transfers objects between hands easily.","Points with index finger.","Bangs, shakes, throws, and drops objects to observe cause and effect."] },
            { "age": 11, "milestone": ["Uses pincer grasp (thumb and forefinger) to pick up small foods or objects.","Points to things of interest and pokes with index finger.","Transfers objects between hands and bangs them together.","Places toys into containers and may start attempting to stack."] },
            { "age": 12, "milestone": ["Has a mature grasp - Uses pincer grasp to pick up small objects accurately.","Points with index finger at objects of interest.","Places objects into and out of containers when shown.","Begins to imitate actions like brushing hair or holding a phone using real objects.","May start scribbling with a crayon if given one.","Uses both hands but may start to show preference for one.","Can release an object / toy gently to give."] }
        ]
    },
    {
        "category": "Sight and Vision",
        "milestones": [
            { "age": 0, "milestone": ["Sees clearly at 20–30 cm (perfect for seeing your face)","Prefers high-contrast patterns and faces.","Begins to track slow movement."]},
            { "age": 1, "milestone": ["Sees clearly about 20–30 cm away .","Prefers faces and high-contrast patterns.","Starts to track slow movement."] },
            { "age": 2, "milestone": ["Follows faces and objects with eyes more smoothly.","Recognizes familiar faces and starts to respond with smiles.","Interested in bold patterns, high-contrast images, and bright colors.","Begins to look at hands and surroundings more."]},
            { "age": 3, "milestone": ["Visually very alert. Follows adult's movements when within available visual field.", "Looks at own hands when lying down; finger play, opening and closing hands, pressing palms of hands together.","Follows moving objects and people smoothly with eyes.","Can recognize familiar faces at a distance.","Explores surroundings visually and looks around more.","Reaches out to grasp with both hands."] },
            { "age": 4, "milestone": ["Follows moving objects and people across midline.","Recognizes familiar faces at a distance.","Shows interest in colors, lights, and patterns."] },
            { "age": 5, "milestone": ["Depth perception improves — reaches more accurately.","Tracks moving objects and people across midline.","Recognizes caregivers from a distance."] },
            { "age": 6, "milestone": ["Tracks moving objects across full visual field.","Recognizes caregiver from across the room.","Reaches accurately for nearby objects (shows awareness of depth up to 30cm).","Shows interest in mirrors and reflections."] },
            { "age": 7, "milestone": ["Explores things visually with more intention.","Tracks moving objects smoothly.","Looks around for dropped or hidden objects.","May begin to understand object permanence (knowing something exists even when hidden)."] },
            { "age": 8, "milestone": ["Tracks small moving objects with accuracy.","Shows preference for certain toys or people.","Watches hidden objects being revealed — learning object permanence.","Reaches for distant or partially hidden items."] },
            { "age": 9, "milestone": ["Tracks moving objects across the room smoothly.","Recognizes familiar people and objects from a distance.","Looks for hidden objects that are partially hidden, showing stronger object permanence.","Explores objects visually and by mouthing."] },
            { "age": 10, "milestone": ["Has full-color vision and depth perception.","Tracks moving objects and people with ease.","Looks for hidden objects — strong object permanence.","Examines toys and objects with curiosity, turning them in hands or banging them."] },
            { "age": 11, "milestone": ["Has well-developed depth perception and hand-eye coordination.","Recognizes and searches for objects that are out of sight.","Tracks small objects moving quickly or from a distance.","Looks for people or toys when named."] },
            { "age": 12, "milestone": ["Explores environment visually and uses vision to guide movements.","Recognizes familiar people and objects across the room.","Looks for hidden objects (strong object permanence), may start to search in several locations.","May visually inspect and compare two items side-by-side."] }
        ]
    },
    {
        "category": "Communication and Language",
        "milestones": [
            { "age": 0, "milestone": ["Cries to express needs (e.g. hunger, discomfort).","Calms in response to soothing, familiar voices."]},
            { "age": 1, "milestone": ["Communicates through crying (different cries for hunger, tiredness, discomfort).","Begins to coo and make soft vowel sounds (around 4–6 weeks).","Responds to soothing tones."] },
            { "age": 2, "milestone": ["Cooing and vowel sounds ('ohh', 'ahh').","May mimic some facial expressions or mouth movements.","May start to imitate some sounds.","Reacts to tone and pitch of voice."]},
            { "age": 3, "milestone": ["Cries when uncomfortable or annoyed.","Makes cooing, gurgling, and vowel-like sounds.","Begins babbling with more variety in pitch and tone.","Proto-conversations: takes turns with you in 'conversations' with vocalisations, smiles, eye contact and hand gestures."] },
            { "age": 4, "milestone": ["Babbles with consonant-like sounds (e.g. 'ba,' 'ga').","Responds to your voice by cooing, smiling, or babbling back.","Begins to show excitement with facial expressions or sounds."] },
            { "age": 5, "milestone": ["Babbles with consonant-like sounds (e.g., 'ba,' 'da,' 'ma').","Makes sounds to express excitement or frustration.","Responds to own name and changes in tone of voice."] },
            { "age": 6, "milestone": ["Babbles repetitively (e.g., 'ba-ba,' 'da-da').","Uses voice to express joy or displeasure.","Responds to name and tone of voice.","Begins to mimic sounds, facial expressions, or mouth movements.","Shows recognition of carer's facial expressions e.g. happy or fearful."] },
            { "age": 7, "milestone": ["Babbles with chains of sounds (e.g., 'ba-ba-ba,' 'da-da-da').","Responds to tones of voice — may stop when told 'no.'","Uses voice to express emotions like excitement, frustration, or joy.","May imitate simple sounds or gestures."] },
            { "age": 8, "milestone": ["Babbles using chains of sounds (e.g., 'ba-ba,' 'da-da,' 'ma-ma').","May say 'mama' or 'dada' (not always directed accurately yet).","Responds to 'no' and simple instructions with tone.","Begins to use gestures (e.g., reaching, pointing, waving)."] },
            { "age": 9, "milestone": ["Responds when name is called.","Understands simple words and commands like 'no' or 'bye-bye.'","Reacts to 'where's mummy/daddy' by looking around.","Vocalises deliberately as a means of communication e.g. shouts to attract attention, listens then shouts again.","May begin to use gestures like waving or clapping.","Babbles loudly and tunefully in long repetitive strings of syllables, often combining consonants (e.g., 'mamama,' 'bababa').","Tries to mimic sounds, gestures or facial expressions e.g. smacking lips, cough, 'brr', hand-clapping."] },
            { "age": 10, "milestone": ["Babbles with varied sounds and speech-like tone (e.g., 'dadada,' 'gagaga').","May say 'mama' or 'dada' with meaning.","Understands simple instructions like 'come here' or 'give it to me.'","Begins using gestures like pointing, waving, or clapping intentionally."] },
            { "age": 11, "milestone": ["Says 1–2 words with meaning, such as 'mama,' 'dada,' or 'uh-oh.'","Uses gestures like pointing, waving, or nodding to communicate.","Understands more words than they can say.","Babbles with intonation that mimics speech (e.g., 'da-da-da?')."] },
            { "age": 12, "milestone": ["Recognises and responds to own name consistently.","Says 1–3 words other than 'mama' and 'dada' with meaning (inconsistent pronunciation).","Understands many more words than they can say.","Shows understanding of objects by use, e.g. when given a hairbrush, may use it on their own hair, or putting a telephone next to their ear.","Uses gestures like pointing, waving, or nodding.","May mimic words (e.g. 'uh-oh') or tones of voice.","Shows recognition of familiar songs by trying to join in. May also frequently respond to familiar songs by vocalising."] }
        ]
    },
    {
        "category": "Social and Emotional Development",
        "milestones": [
            { "age": 0, "milestone": ["Begins bonding with caregivers through touch, voice, and smell.","Feels secure through touch, cuddling, and consistent care.","Makes brief eye contact during alert moments."]},
            { "age": 1, "milestone": ["Calms when held or spoken to.","Progressing to social smile and responds to caregiver by vocalising (5-6 weeks).","Builds trust and emotional security through consistent, responsive care."] },
            { "age": 2, "milestone": ["Social smiling - in response to voices and faces.","Smiles more intentionally with familiar people.","Enjoys social interaction and may initiate it with smiles or sounds.","May show signs of separation anxiety when away from primary caregiver.","Enjoys social interactions and may coo or gurgle in response to others."]},
            { "age": 3, "milestone": ["Starting to show reactions to familiar situations by smiling, cooing and excited movements (e.g. feeding, bathing and care routines).","Responds happily to friendly handling, especially when accompanied by playful tickling, child-directed sepech and singing.","Begins to develop a sense of routine and predictability.","May show brief distress when interaction stops (e.g. you walk away)."] },
            { "age": 4, "milestone": ["Laughs out loud during play or social interaction.","Enjoys playtime and may cry when it ends.","Smiles spontaneously, especially at people."] },
            { "age": 5, "milestone": ["Enjoys social interaction and may try to engage others with sounds or smiles.","Shows affection to familiar caregivers (smiling, reaching, cuddling).","May begin to recognize and react to strangers."] },
            { "age": 6, "milestone": ["Recognizes familiar faces and may show wariness with strangers (especially when approached too closely or abruptly and if familiar adult is out of sight).","Laughs out loud and shows a wide range of emotions.","Enjoys interactive games like peek-a-boo.","May reach out to be picked up or comforted."] },
            { "age": 7, "milestone": ["Knows familiar faces and may show anxiety around strangers.","Enjoys social play (peek-a-boo, tickles, etc.).","Responds to affection and may cuddle or reach for caregivers.","Expresses a range of emotions clearly (smiling, fussing, giggling)."] },
            { "age": 8, "milestone": ["Shows strong attachment to caregivers and may display separation anxiety.","Enjoys interactive play, especially peek-a-boo or clapping games.","Smiles, laughs, or shows preferences for familiar people and toys.","May show shyness or fear around strangers."] },
            { "age": 9, "milestone": ["Shows strong attachment to caregivers; may experience separation anxiety.","Prefers familiar people and may be cautious with strangers, e.g. clings to known person and hides face. Requires reassurance before accepting strangers/unfamiliar people's advances.","Actively seeks interaction — may reach to be picked up or initiate play.","Expresses a wider range of emotions and reactions.","Offers food or objects to familiar people and animals to initiate interaction with them."] },
            { "age": 10, "milestone": ["Shows strong attachment to caregivers; may cry when separated.","Enjoys social games like peek-a-boo and pat-a-cake.","May show preferences for certain toys or people.","Expresses affection and may imitate social behavior (e.g. hugging a toy)."] },
            { "age": 11, "milestone": ["Shows affection toward familiar people (e.g., hugs, cuddles).","Demonstrates separation anxiety or stranger wariness.","Engages in simple social games like peek-a-boo or pat-a-cake.","May show frustration when needs aren’t understood."] },
            { "age": 12, "milestone": ["Shows affection to caregivers (e.g., hugging, reaching for you).","Likes to be in sight and hearing of familiar people.","Has favorite people and objects (e.g., toys, blanket).","May exhibit stranger anxiety or separation distress.","Enjoys interactive games like peek-a-boo or pat-a-cake.","Begins testing boundaries ('throwing food,' waiting for your reaction)."] }
        ]
    }
]